docs/load-test/20260130-090818-collapsing.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0031/1000 VUs, 0 complete and 0 interrupted iterations
load_test   [   1% ] 0031/1000 VUs  0m00.9s/2m00.0s

running (0m01.9s), 0064/1000 VUs, 30 complete and 0 interrupted iterations
load_test   [   2% ] 0064/1000 VUs  0m01.9s/2m00.0s

running (0m02.9s), 0098/1000 VUs, 94 complete and 0 interrupted iterations
load_test   [   2% ] 0098/1000 VUs  0m02.9s/2m00.0s

running (0m03.9s), 0131/1000 VUs, 189 complete and 0 interrupted iterations
load_test   [   3% ] 0131/1000 VUs  0m03.9s/2m00.0s

running (0m04.9s), 0164/1000 VUs, 318 complete and 0 interrupted iterations
load_test   [   4% ] 0164/1000 VUs  0m04.9s/2m00.0s

running (0m05.9s), 0198/1000 VUs, 478 complete and 0 interrupted iterations
load_test   [   5% ] 0198/1000 VUs  0m05.9s/2m00.0s

running (0m06.9s), 0231/1000 VUs, 672 complete and 0 interrupted iterations
load_test   [   6% ] 0231/1000 VUs  0m06.9s/2m00.0s

running (0m07.9s), 0264/1000 VUs, 896 complete and 0 interrupted iterations
load_test   [   7% ] 0264/1000 VUs  0m07.9s/2m00.0s

running (0m08.9s), 0298/1000 VUs, 1152 complete and 0 interrupted iterations
load_test   [   7% ] 0298/1000 VUs  0m08.9s/2m00.0s

running (0m09.9s), 0331/1000 VUs, 1448 complete and 0 interrupted iterations
load_test   [   8% ] 0331/1000 VUs  0m09.9s/2m00.0s

running (0m10.9s), 0364/1000 VUs, 1770 complete and 0 interrupted iterations
load_test   [   9% ] 0364/1000 VUs  0m10.9s/2m00.0s

running (0m11.9s), 0398/1000 VUs, 2126 complete and 0 interrupted iterations
load_test   [  10% ] 0398/1000 VUs  0m11.9s/2m00.0s

running (0m12.9s), 0431/1000 VUs, 2516 complete and 0 interrupted iterations
load_test   [  11% ] 0431/1000 VUs  0m12.9s/2m00.0s

running (0m13.9s), 0464/1000 VUs, 2928 complete and 0 interrupted iterations
load_test   [  12% ] 0464/1000 VUs  0m13.9s/2m00.0s

running (0m14.9s), 0498/1000 VUs, 3385 complete and 0 interrupted iterations
load_test   [  12% ] 0498/1000 VUs  0m14.9s/2m00.0s

running (0m15.9s), 0531/1000 VUs, 3869 complete and 0 interrupted iterations
load_test   [  13% ] 0531/1000 VUs  0m15.9s/2m00.0s

running (0m16.9s), 0564/1000 VUs, 4383 complete and 0 interrupted iterations
load_test   [  14% ] 0564/1000 VUs  0m16.9s/2m00.0s

running (0m17.9s), 0598/1000 VUs, 4928 complete and 0 interrupted iterations
load_test   [  15% ] 0598/1000 VUs  0m17.9s/2m00.0s

running (0m18.9s), 0631/1000 VUs, 5499 complete and 0 interrupted iterations
load_test   [  16% ] 0631/1000 VUs  0m18.9s/2m00.0s

running (0m19.9s), 0664/1000 VUs, 6118 complete and 0 interrupted iterations
load_test   [  17% ] 0664/1000 VUs  0m19.9s/2m00.0s

running (0m20.9s), 0698/1000 VUs, 6768 complete and 0 interrupted iterations
load_test   [  17% ] 0698/1000 VUs  0m20.9s/2m00.0s

running (0m21.9s), 0731/1000 VUs, 7446 complete and 0 interrupted iterations
load_test   [  18% ] 0731/1000 VUs  0m21.9s/2m00.0s

running (0m22.9s), 0764/1000 VUs, 8140 complete and 0 interrupted iterations
load_test   [  19% ] 0764/1000 VUs  0m22.9s/2m00.0s

running (0m23.9s), 0798/1000 VUs, 8880 complete and 0 interrupted iterations
load_test   [  20% ] 0798/1000 VUs  0m23.9s/2m00.0s

running (0m24.9s), 0831/1000 VUs, 9660 complete and 0 interrupted iterations
load_test   [  21% ] 0831/1000 VUs  0m24.9s/2m00.0s

running (0m25.9s), 0864/1000 VUs, 10422 complete and 0 interrupted iterations
load_test   [  22% ] 0864/1000 VUs  0m25.9s/2m00.0s

running (0m26.9s), 0898/1000 VUs, 11178 complete and 0 interrupted iterations
load_test   [  22% ] 0898/1000 VUs  0m26.9s/2m00.0s

running (0m27.9s), 0931/1000 VUs, 11959 complete and 0 interrupted iterations
load_test   [  23% ] 0931/1000 VUs  0m27.9s/2m00.0s

running (0m28.9s), 0964/1000 VUs, 12738 complete and 0 interrupted iterations
load_test   [  24% ] 0964/1000 VUs  0m28.9s/2m00.0s

running (0m29.9s), 0998/1000 VUs, 13433 complete and 0 interrupted iterations
load_test   [  25% ] 0998/1000 VUs  0m29.9s/2m00.0s

running (0m30.9s), 1000/1000 VUs, 14340 complete and 0 interrupted iterations
load_test   [  26% ] 1000/1000 VUs  0m30.9s/2m00.0s

running (0m31.9s), 1000/1000 VUs, 14909 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m31.9s/2m00.0s

running (0m32.9s), 1000/1000 VUs, 15884 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m32.9s/2m00.0s

running (0m33.9s), 1000/1000 VUs, 16420 complete and 0 interrupted iterations
load_test   [  28% ] 1000/1000 VUs  0m33.9s/2m00.0s

running (0m34.9s), 1000/1000 VUs, 17380 complete and 0 interrupted iterations
load_test   [  29% ] 1000/1000 VUs  0m34.9s/2m00.0s

running (0m35.9s), 1000/1000 VUs, 17912 complete and 0 interrupted iterations
load_test   [  30% ] 1000/1000 VUs  0m35.9s/2m00.0s

running (0m36.9s), 1000/1000 VUs, 18882 complete and 0 interrupted iterations
load_test   [  31% ] 1000/1000 VUs  0m36.9s/2m00.0s

running (0m37.9s), 1000/1000 VUs, 19443 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m37.9s/2m00.0s

running (0m38.9s), 1000/1000 VUs, 20391 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m38.9s/2m00.0s

running (0m39.9s), 1000/1000 VUs, 20988 complete and 0 interrupted iterations
load_test   [  33% ] 1000/1000 VUs  0m39.9s/2m00.0s

running (0m40.9s), 1000/1000 VUs, 21931 complete and 0 interrupted iterations
load_test   [  34% ] 1000/1000 VUs  0m40.9s/2m00.0s

running (0m41.9s), 1000/1000 VUs, 22615 complete and 0 interrupted iterations
load_test   [  35% ] 1000/1000 VUs  0m41.9s/2m00.0s

running (0m42.9s), 1000/1000 VUs, 23252 complete and 0 interrupted iterations
load_test   [  36% ] 1000/1000 VUs  0m42.9s/2m00.0s

running (0m43.9s), 1000/1000 VUs, 24171 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m43.9s/2m00.0s

running (0m44.9s), 1000/1000 VUs, 24739 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m44.9s/2m00.0s

running (0m45.9s), 1000/1000 VUs, 25706 complete and 0 interrupted iterations
load_test   [  38% ] 1000/1000 VUs  0m45.9s/2m00.0s

running (0m46.9s), 1000/1000 VUs, 26241 complete and 0 interrupted iterations
load_test   [  39% ] 1000/1000 VUs  0m46.9s/2m00.0s

running (0m47.9s), 1000/1000 VUs, 27196 complete and 0 interrupted iterations
load_test   [  40% ] 1000/1000 VUs  0m47.9s/2m00.0s

running (0m48.9s), 1000/1000 VUs, 27782 complete and 0 interrupted iterations
load_test   [  41% ] 1000/1000 VUs  0m48.9s/2m00.0s

running (0m49.9s), 1000/1000 VUs, 28744 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m49.9s/2m00.0s

running (0m50.9s), 1000/1000 VUs, 29317 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m50.9s/2m00.0s

running (0m51.9s), 1000/1000 VUs, 30256 complete and 0 interrupted iterations
load_test   [  43% ] 1000/1000 VUs  0m51.9s/2m00.0s

running (0m52.9s), 1000/1000 VUs, 30891 complete and 0 interrupted iterations
load_test   [  44% ] 1000/1000 VUs  0m52.9s/2m00.0s

running (0m53.9s), 1000/1000 VUs, 31610 complete and 0 interrupted iterations
load_test   [  45% ] 1000/1000 VUs  0m53.9s/2m00.0s

running (0m54.9s), 1000/1000 VUs, 32464 complete and 0 interrupted iterations
load_test   [  46% ] 1000/1000 VUs  0m54.9s/2m00.0s

running (0m55.9s), 1000/1000 VUs, 33068 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m55.9s/2m00.0s

running (0m56.9s), 1000/1000 VUs, 33922 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m56.9s/2m00.0s

running (0m57.9s), 1000/1000 VUs, 34569 complete and 0 interrupted iterations
load_test   [  48% ] 1000/1000 VUs  0m57.9s/2m00.0s

running (0m58.9s), 1000/1000 VUs, 35440 complete and 0 interrupted iterations
load_test   [  49% ] 1000/1000 VUs  0m58.9s/2m00.0s

running (0m59.9s), 1000/1000 VUs, 36082 complete and 0 interrupted iterations
load_test   [  50% ] 1000/1000 VUs  0m59.9s/2m00.0s

running (1m00.9s), 1000/1000 VUs, 36973 complete and 0 interrupted iterations
load_test   [  51% ] 1000/1000 VUs  1m00.9s/2m00.0s

running (1m01.9s), 1000/1000 VUs, 37603 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m01.9s/2m00.0s

running (1m02.9s), 1000/1000 VUs, 38550 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m02.9s/2m00.0s

running (1m03.9s), 1000/1000 VUs, 39114 complete and 0 interrupted iterations
load_test   [  53% ] 1000/1000 VUs  1m03.9s/2m00.0s

running (1m04.9s), 1000/1000 VUs, 40076 complete and 0 interrupted iterations
load_test   [  54% ] 1000/1000 VUs  1m04.9s/2m00.0s

running (1m05.9s), 1000/1000 VUs, 40628 complete and 0 interrupted iterations
load_test   [  55% ] 1000/1000 VUs  1m05.9s/2m00.0s

running (1m06.9s), 1000/1000 VUs, 41572 complete and 0 interrupted iterations
load_test   [  56% ] 1000/1000 VUs  1m06.9s/2m00.0s

running (1m07.9s), 1000/1000 VUs, 42241 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m07.9s/2m00.0s

running (1m08.9s), 1000/1000 VUs, 42914 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m08.9s/2m00.0s

running (1m09.9s), 1000/1000 VUs, 43822 complete and 0 interrupted iterations
load_test   [  58% ] 1000/1000 VUs  1m09.9s/2m00.0s

running (1m10.9s), 1000/1000 VUs, 44379 complete and 0 interrupted iterations
load_test   [  59% ] 1000/1000 VUs  1m10.9s/2m00.0s

running (1m11.9s), 1000/1000 VUs, 45333 complete and 0 interrupted iterations
load_test   [  60% ] 1000/1000 VUs  1m11.9s/2m00.0s

running (1m12.9s), 1000/1000 VUs, 45841 complete and 0 interrupted iterations
load_test   [  61% ] 1000/1000 VUs  1m12.9s/2m00.0s

running (1m13.9s), 1000/1000 VUs, 46788 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m13.9s/2m00.0s

running (1m14.9s), 1000/1000 VUs, 47319 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m14.9s/2m00.0s

running (1m15.9s), 1000/1000 VUs, 48290 complete and 0 interrupted iterations
load_test   [  63% ] 1000/1000 VUs  1m15.9s/2m00.0s

running (1m16.9s), 1000/1000 VUs, 48847 complete and 0 interrupted iterations
load_test   [  64% ] 1000/1000 VUs  1m16.9s/2m00.0s

running (1m17.9s), 1000/1000 VUs, 49790 complete and 0 interrupted iterations
load_test   [  65% ] 1000/1000 VUs  1m17.9s/2m00.0s

running (1m18.9s), 1000/1000 VUs, 50425 complete and 0 interrupted iterations
load_test   [  66% ] 1000/1000 VUs  1m18.9s/2m00.0s

running (1m19.9s), 1000/1000 VUs, 51309 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m19.9s/2m00.0s

running (1m20.9s), 1000/1000 VUs, 52048 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m20.9s/2m00.0s

running (1m21.9s), 1000/1000 VUs, 52624 complete and 0 interrupted iterations
load_test   [  68% ] 1000/1000 VUs  1m21.9s/2m00.0s

running (1m22.9s), 1000/1000 VUs, 53595 complete and 0 interrupted iterations
load_test   [  69% ] 1000/1000 VUs  1m22.9s/2m00.0s

running (1m23.9s), 1000/1000 VUs, 54124 complete and 0 interrupted iterations
load_test   [  70% ] 1000/1000 VUs  1m23.9s/2m00.0s

running (1m24.9s), 1000/1000 VUs, 55083 complete and 0 interrupted iterations
load_test   [  71% ] 1000/1000 VUs  1m24.9s/2m00.0s

running (1m25.9s), 1000/1000 VUs, 55623 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m25.9s/2m00.0s

running (1m26.9s), 1000/1000 VUs, 56588 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m26.9s/2m00.0s

running (1m27.9s), 1000/1000 VUs, 57158 complete and 0 interrupted iterations
load_test   [  73% ] 1000/1000 VUs  1m27.9s/2m00.0s

running (1m28.9s), 1000/1000 VUs, 58111 complete and 0 interrupted iterations
load_test   [  74% ] 1000/1000 VUs  1m28.9s/2m00.0s

running (1m29.9s), 1000/1000 VUs, 58733 complete and 0 interrupted iterations
load_test   [  75% ] 1000/1000 VUs  1m29.9s/2m00.0s

running (1m30.9s), 0984/1000 VUs, 59644 complete and 0 interrupted iterations
load_test   [  76% ] 0984/1000 VUs  1m30.9s/2m00.0s

running (1m31.9s), 0959/1000 VUs, 60343 complete and 0 interrupted iterations
load_test   [  77% ] 0959/1000 VUs  1m31.9s/2m00.0s

running (1m32.9s), 0927/1000 VUs, 61026 complete and 0 interrupted iterations
load_test   [  77% ] 0927/1000 VUs  1m32.9s/2m00.0s

running (1m33.9s), 0895/1000 VUs, 61848 complete and 0 interrupted iterations
load_test   [  78% ] 0895/1000 VUs  1m33.9s/2m00.0s

running (1m34.9s), 0861/1000 VUs, 62600 complete and 0 interrupted iterations
load_test   [  79% ] 0861/1000 VUs  1m34.9s/2m00.0s

running (1m35.9s), 0821/1000 VUs, 63340 complete and 0 interrupted iterations
load_test   [  80% ] 0821/1000 VUs  1m35.9s/2m00.0s

running (1m36.9s), 0785/1000 VUs, 64152 complete and 0 interrupted iterations
load_test   [  81% ] 0785/1000 VUs  1m36.9s/2m00.0s

running (1m37.9s), 0756/1000 VUs, 64719 complete and 0 interrupted iterations
load_test   [  82% ] 0756/1000 VUs  1m37.9s/2m00.0s

running (1m38.9s), 0723/1000 VUs, 65447 complete and 0 interrupted iterations
load_test   [  82% ] 0723/1000 VUs  1m38.9s/2m00.0s

running (1m39.9s), 0685/1000 VUs, 66113 complete and 0 interrupted iterations
load_test   [  83% ] 0685/1000 VUs  1m39.9s/2m00.0s

running (1m40.9s), 0649/1000 VUs, 66790 complete and 0 interrupted iterations
load_test   [  84% ] 0649/1000 VUs  1m40.9s/2m00.0s

running (1m41.9s), 0616/1000 VUs, 67420 complete and 0 interrupted iterations
load_test   [  85% ] 0616/1000 VUs  1m41.9s/2m00.0s

running (1m42.9s), 0590/1000 VUs, 67957 complete and 0 interrupted iterations
load_test   [  86% ] 0590/1000 VUs  1m42.9s/2m00.0s

running (1m43.9s), 0553/1000 VUs, 68535 complete and 0 interrupted iterations
load_test   [  87% ] 0553/1000 VUs  1m43.9s/2m00.0s

running (1m44.9s), 0519/1000 VUs, 69083 complete and 0 interrupted iterations
load_test   [  87% ] 0519/1000 VUs  1m44.9s/2m00.0s

running (1m45.9s), 0487/1000 VUs, 69589 complete and 0 interrupted iterations
load_test   [  88% ] 0487/1000 VUs  1m45.9s/2m00.0s

running (1m46.9s), 0456/1000 VUs, 70064 complete and 0 interrupted iterations
load_test   [  89% ] 0456/1000 VUs  1m46.9s/2m00.0s

running (1m47.9s), 0417/1000 VUs, 70516 complete and 0 interrupted iterations
load_test   [  90% ] 0417/1000 VUs  1m47.9s/2m00.0s

running (1m48.9s), 0387/1000 VUs, 70931 complete and 0 interrupted iterations
load_test   [  91% ] 0387/1000 VUs  1m48.9s/2m00.0s

running (1m49.9s), 0355/1000 VUs, 71316 complete and 0 interrupted iterations
load_test   [  92% ] 0355/1000 VUs  1m49.9s/2m00.0s

running (1m50.9s), 0320/1000 VUs, 71657 complete and 0 interrupted iterations
load_test   [  92% ] 0320/1000 VUs  1m50.9s/2m00.0s

running (1m51.9s), 0287/1000 VUs, 71967 complete and 0 interrupted iterations
load_test   [  93% ] 0287/1000 VUs  1m51.9s/2m00.0s

running (1m52.9s), 0253/1000 VUs, 72251 complete and 0 interrupted iterations
load_test   [  94% ] 0253/1000 VUs  1m52.9s/2m00.0s

running (1m53.9s), 0218/1000 VUs, 72499 complete and 0 interrupted iterations
load_test   [  95% ] 0218/1000 VUs  1m53.9s/2m00.0s

running (1m54.9s), 0187/1000 VUs, 72714 complete and 0 interrupted iterations
load_test   [  96% ] 0187/1000 VUs  1m54.9s/2m00.0s

running (1m55.9s), 0156/1000 VUs, 72898 complete and 0 interrupted iterations
load_test   [  97% ] 0156/1000 VUs  1m55.9s/2m00.0s

running (1m56.9s), 0121/1000 VUs, 73053 complete and 0 interrupted iterations
load_test   [  97% ] 0121/1000 VUs  1m56.9s/2m00.0s

running (1m57.9s), 0088/1000 VUs, 73173 complete and 0 interrupted iterations
load_test   [  98% ] 0088/1000 VUs  1m57.9s/2m00.0s

running (1m58.9s), 0055/1000 VUs, 73260 complete and 0 interrupted iterations
load_test   [  99% ] 0055/1000 VUs  1m58.9s/2m00.0s

running (1m59.9s), 0017/1000 VUs, 73315 complete and 0 interrupted iterations
load_test   [ 100% ] 0017/1000 VUs  1m59.9s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=938.93ms
    ✓ 'p(99)<5000' p(99)=1.25s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 146664 1214.869513/s
    checks_succeeded...: 97.90% 143595 out of 146664
    checks_failed......: 2.09%  3069 out of 146664

    ✓ status is 200
    ✗ response time < 1000ms
      ↳  95% — ✓ 70263 / ✗ 3069

    HTTP
    http_req_duration..............: avg=233.75ms min=6.12ms med=89.06ms max=9.34s  p(90)=640.35ms p(95)=938.93ms
      { expected_response:true }...: avg=233.75ms min=6.12ms med=89.06ms max=9.34s  p(90)=640.35ms p(95)=938.93ms
    http_req_failed................: 0.00%  0 out of 73332
    http_reqs......................: 73332  607.434756/s

    EXECUTION
    iteration_duration.............: avg=1.23s    min=1s     med=1.08s   max=10.34s p(90)=1.64s    p(95)=1.94s   
    iterations.....................: 73332  607.434756/s
    vus............................: 17     min=17         max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 963 MB 8.0 MB/s
    data_sent......................: 8.4 MB 70 kB/s



running (2m00.7s), 0000/1000 VUs, 73332 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 0000/1000 VUs  2m0s